app/controllers/api/transactions_controller.rb

  def create
    @stock = Stock.find_by(ticker: params["transaction"]["stock_id"]) || Stock.create!(ticker: params["transaction"]["stock_id"])
    @transaction = Transaction.new(transaction_params)

    if current_user.balance > (@transaction.price * @transaction.quantity).round(2)

      if @transaction.save
        new_balance = current_user.balance - (@transaction.price * @transaction.quantity).round(2)
        current_user.update_attributes(balance: new_balance)
---
INSERT INTO "transactions" ("quantity", "stock_id", "user_id", "price", "transaction_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "stocks" ("ticker", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["ticker", "B"], ["created_at", "2020-02-20 18:48:46.659122"], ["updated_at", "2020-02-20 18:48:46.659122"]]
SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker" = $1 LIMIT $2  [["ticker", "A"], ["LIMIT", 1]]
INSERT INTO "transactions" ("quantity", "stock_id", "user_id", "price", "transaction_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["quantity", 4], ["stock_id", "P"], ["user_id", 2], ["price", "8.38"], ["transaction_time", "2020-2-21"], ["created_at", "2020-02-21 16:17:43.305202"], ["updated_at", "2020-02-21 16:17:43.305202"]]
UPDATE "users" SET "balance" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["balance", 26.35], ["updated_at", "2020-02-21 16:17:43.318434"], ["id", 2]]